
%% 传感器分布矩阵
% x = [7.5 36.5 65.5];
% y = [5.5 32.5 59.5];
% z = [
%     21 22 23
%     24 25 26
%     27 28 29 ];

% 人体热量计算公式
% hc为对流交换系数
% C = hc(tb - Ta);


%% 产生网格矩阵
% array = meshgrid(Xi, Yi, Zi);
[xi, yi] = meshgrid(7.5: 10: 65.5, 5.5: 10: 59.5);


%% 例如预设温度为21℃，采用一组试验中测得的温度值
[x,y] = meshgrid(7.5: 65.5, 5.5: 59.5);

z = [
    21    21    19    21    21    21
    21    19    18    20    17    21
    21    20    18    17    21    20
    21    18    16    20    19    21
    21    16    15    14    15    21
    21    21    21    21    20    21 ];


%% spline（三次样条差值法）
% 在实际中温度的变化必然是连续的，故而得到的温度场中通过任意点的截面截出的曲线必然是连续可导的，
% 故而必须使用spline（三次样条插值法）得到光滑的插值分布曲线。

% interp2（二维插值法）
% 该温度场现实的是传感器分布面上的温度分布，故而必须采用interp2（二维插值法），
% 同时用第三维的高度值的变化和连续变化的颜色来显示温度的连续变化。

% zi = interp2(xi, yi, 'spline');
zi = interp2(xi, yi, z, xi, yi, 'spline');


%% matlab自定义的三维曲面绘制函数
surf(xi, yi, zi);


%% 等高线图
[c, h] = contour(xi, yi, zi);
clabel(c, h);


